{
  "exist": "(stative) to be; have existence; have being or reality",
  "ought": "Property; possession",
  "until": "Up to the time of (something happening).",
  "woman": "An adult female human.",
  "river": "A large and often winding stream which drains a land mass, carrying water down from higher areas to a lower point, oftentimes ending in another body of water, such as an ocean or in an inland sea.",
  "storm": "Any disturbed state of the atmosphere, especially as affecting the earth's surface, and strongly implying destructive or unpleasant weather.",
  "shift": "A modifier key whose main function is shifting between two or more functions of any of certain other keys (usually by pressing Shift and the other button simultaneously).",
  "large": "An old musical note, equal to two longas, four breves, or eight semibreves.",
  "equal": "A person or thing of equal status to others.",
  "light": "Visible electromagnetic radiation. The human eye can typically detect radiation (light) in the wavelength range of about 400 to 750 nanometers. Nearby shorter and longer wavelength ranges, although not visible, are commonly called ultraviolet and infrared light.",
  "first": "The person or thing in the first position.",
  "upper": "A stimulant, such as amphetamine, that increases energy and decreases appetite.",
  "never": "At no time; on no occasion; in no circumstance.",
  "video": "Television, television show, movie.",
  "short": "A short circuit.",
  "bread": "A foodstuff made by baking dough made from cereals.",
  "smart": "To hurt or sting.",
  "refer": "To direct the attention of.",
  "start": "The beginning of an activity.",
  "front": "The foremost side of something or the end that faces the direction it normally moves.",
  "empty": "(usually plural) A container, especially a bottle, whose contents have been used up, leaving it empty.",
  "begun": "To start, to initiate or take the first step into something.",
  "trade": "Buying and selling of goods and services on a market.",
  "cloud": "A rock; boulder; a hill.",
  "mount": "A hill or mountain.",
  "pride": "The quality or state of being proud; an unreasonable overestimation of one's own superiority in terms of talents, looks, wealth, importance etc., which manifests itself in lofty airs, distance, reserve and often contempt of others.",
  "value": "The quality (positive or negative) that renders something desirable or valuable.",
  "draft": "A current of air, usually coming into a room or vehicle.",
  "began": "To start, to initiate or take the first step into something.",
  "force": "Strength or energy of body or mind; active power; vigour; might; capacity of exercising an influence or producing an effect.",
  "under": "Being lower; being beneath something.",
  "sharp": "The symbol ♯, placed after the name of a note in the key signature or before a note on the staff to indicate that the note is to be played a semitone higher.",
  "clean": "Removal of dirt.",
  "sorry": "The act of saying sorry; an apology.",
  "stuck": "To become or remain attached; to adhere.",
  "proof": "An effort, process, or operation designed to establish or discover a fact or truth; an act of testing; a test; a trial.",
  "urban": "Related to the (or any) city.",
  "coach": "A wheeled vehicle, generally drawn by horse power.",
  "local": "A person who lives near a given place.",
  "horse": "Any of several animals related to Equus ferus caballus.",
  "tight": "",
  "event": "An occurrence; something that happens.",
  "daily": "Something that is produced, consumed, used, or done every day.",
  "cream": "The butterfat/milkfat part of milk which rises to the top; this part when separated from the remainder.",
  "taken": "To get into one's hands, possession or control, with or without force.",
  "smile": "A facial expression comprised by flexing the muscles of both ends of one's mouth, often showing the front teeth, without vocalisation, and in humans is a common involuntary or voluntary expression of happiness, pleasure, amusement or anxiety.",
  "brown": "A colour like that of chocolate or coffee.",
  "reach": "The act of stretching or extending; extension.",
  "fully": "In a full manner; without lack or defect.",
  "logic": "A method of human thought that involves thinking in a linear, step-by-step manner about how a problem can be solved. Logic is the basis of many principles including the scientific method.",
  "tower": "A very tall iron-framed structure, usually painted red and white, on which microwave, radio, satellite, or other communication antennas are installed; mast.",
  "march": "A formal, rhythmic way of walking, used especially by soldiers, bands and in ceremonies.",
  "style": "Senses relating to a thin, pointed object.",
  "badge": "A distinctive mark, token, sign, emblem or cognizance, worn on one's clothing, as an insignia of some rank, or of the membership of an organization.",
  "voice": "Sound uttered by the mouth, especially by human beings in speech or song; sound thus uttered considered as possessing some special quality or character",
  "seven": "The digit/figure 7 or an occurrence thereof.",
  "block": "A substantial, often approximately cuboid, piece of any substance.",
  "story": "A sequence of real or fictional events; or, an account of such a sequence.",
  "exact": "To demand and enforce the payment or performance of, sometimes in a forcible or imperious way.",
  "angle": "A figure formed by two rays which start from a common point (a plane angle) or by three planes that intersect (a solid angle).",
  "trust": "Confidence in or reliance on some person or quality.",
  "faith": "A trust or confidence in the intentions or abilities of a person, object, or ideal from prior empirical evidence.",
  "chain": "A series of interconnected rings or links usually made of metal.",
  "clock": "An instrument used to measure or keep track of time; a non-portable timepiece.",
  "stick": "An elongated piece of wood or similar material, typically put to some use, for example as a wand or baton.",
  "spent": "To pay out (money).",
  "truth": "True facts, genuine depiction or statements of reality.",
  "earth": "The third planet of the Solar System; the world upon which humans live.",
  "issue": "The action or an instance of flowing or coming out, an outflow, particularly:",
  "match": "A competitive sporting event such as a boxing meet, a baseball game, or a cricket match.",
  "month": "A period into which a year is divided, historically based on the phases of the moon.",
  "price": "The cost required to gain possession of something.",
  "heart": "A muscular organ that pumps blood through the body, traditionally thought to be the seat of emotion.",
  "share": "A portion of something, especially a portion given or allotted to someone.",
  "judge": "A public official whose duty it is to administer the law, especially by presiding over trials and rendering judgments; a justice.",
  "yield": "To pay, give in payment; repay, recompense; reward; requite.",
  "third": "The person or thing in the third position.",
  "while": "An uncertain duration of time, a period of time.",
  "yours": "That which belongs to you (singular); the possessive second-person singular pronoun used without a following noun.",
  "coast": "The edge of the land where it meets an ocean, sea, gulf, bay, or large lake.",
  "rural": "A person from the countryside; a rustic.",
  "taste": "One of the sensations produced by the tongue in response to certain chemicals; the quality of giving this sensation.",
  "cable": "(material) A long object used to make a physical connection.",
  "north": "One of the four major compass points, specifically 0°, directed toward the North Pole, and conventionally upwards on a map, abbreviated as N.",
  "spoke": "A support structure that connects the axle or the hub of a wheel to the rim.",
  "label": "A small ticket or sign giving information about something to which it is attached or intended to be attached.",
  "panel": "A (usually) rectangular section of a surface, or of a covering or of a wall, fence etc.",
  "prize": "That which is taken from another; something captured; a thing seized by force, stratagem, or superior power.",
  "dozen": "A set of twelve.",
  "phone": "A device for transmitting conversations and other sounds in real time across distances, now often a small portable unit also capable of running software etc.",
  "apron": "An article of clothing worn over the front of the torso and/or legs for protection from spills; also historically worn by Freemasons and as part of women's fashion.",
  "night": "The period between sunset and sunrise, when a location faces far away from the sun, thus when the sky is dark.",
  "crash": "A sudden, intense, loud sound, as made for example by cymbals.",
  "choir": "Singing group; group of people who sing together; company of people who are trained to sing together.",
  "enter": "The \"Enter\" key on a computer keyboard.",
  "thick": "The thickest, or most active or intense, part of something.",
  "noise": "Various sounds, usually unwanted or unpleasant.",
  "route": "A course or way which is traveled or passed.",
  "wrong": "Something that is immoral or not good.",
  "rapid": "(often in the plural) a rough section of a river or stream which is difficult to navigate due to the swift and turbulent motion of the water.",
  "write": "The act or style of writing.",
  "south": "One of the four major compass points, specifically 180°, directed toward the South Pole, and conventionally downwards on a map, abbreviated as S.",
  "think": "An act of thinking; consideration (of something).",
  "flame": "The visible part of fire; a stream of burning vapour or gas, emitting light and heat.",
  "crowd": "A group of people congregated or collected into a close body without order.",
  "giant": "A mythical human of very great size.",
  "dance": "A sequence of rhythmic steps or movements usually performed to music, for pleasure or as a form of social interaction.",
  "water": "A substance (of molecular formula H₂O) found at room temperature and pressure as a clear liquid; it is present naturally as rain, and found in rivers, lakes and seas; its solid form is ice and its gaseous form is steam.",
  "teach": "To show (someone) the way; to guide, conduct; to point, indicate.",
  "fresh": "A rush of water, along a river or onto the land; a flood.",
  "funny": "A joke.",
  "brand": "A conflagration; a flame.",
  "ready": "Ready money; cash",
  "queen": "A female monarch. Example: Queen Victoria.",
  "sense": "Any of the manners by which living beings perceive the physical world: for humans sight, smell, hearing, touch, taste.",
  "score": "The total number of goals, points, runs, etc. earned by a participant in a game.",
  "limit": "A restriction; a bound beyond which one may not go.",
  "movie": "A recorded sequence of images displayed on a screen at a rate sufficiently fast to create the appearance of motion.",
  "still": "A period of calm or silence.",
  "loose": "The release of an arrow.",
  "scope": "The breadth, depth or reach of a subject; a domain.",
  "focus": "A point at which reflected or refracted rays of light converge.",
  "known": "To perceive the truth or factuality of; to be certain of or that.",
  "scale": "A ladder; a series of steps; a means of ascending.",
  "valid": "Well grounded or justifiable, pertinent.",
  "needs": "Of necessity; necessarily; indispensably; used with an auxiliary verb (often must), and equivalent to \"of need\".",
  "track": "A mark left by something that has passed along.",
  "often": "Frequent.",
  "buyer": "A person who makes one or more purchases.",
  "doubt": "Disbelief or uncertainty (about something); a particular instance of such disbelief or uncertainty.",
  "stone": "A hard earthen substance that can form large rocks.",
  "least": "Something of the smallest possible extent; an indivisible unit.",
  "bound": "To tie; to confine by any ligature.",
  "learn": "The act of learning something",
  "store": "A place where items may be accumulated or routinely kept.",
  "apple": "A common, round fruit produced by the tree Malus domestica, cultivated in temperate climates.",
  "spend": "Amount of money spent (during a period); expenditure.",
  "shelf": "A flat, rigid structure, fixed at right angles to a wall or forming a part of a cabinet, desk etc., and used to support, store or display objects.",
  "world": "(with \"the\") Human collective existence; existence in general.",
  "thank": "An expression of appreciation; a thought.",
  "order": "Arrangement, disposition, or sequence.",
  "every": "",
  "radio": "The technology that allows for the transmission of sound or other signals by modulation of electromagnetic waves.",
  "pitch": "A sticky, gummy substance secreted by trees; sap.",
  "train": "Elongated portion.",
  "brick": "A hardened rectangular block of mud, clay etc., used for building.",
  "theme": "A subject of a talk or an artistic piece; a topic.",
  "close": "An end or conclusion.",
  "times": "The inevitable progression into the future with the passing of present and past events.",
  "watch": "A portable or wearable timepiece.",
  "scene": "The location of an event that attracts attention.",
  "fleet": "A group of vessels or vehicles.",
  "serve": "An act of putting the ball or shuttlecock in play in various games.",
  "newly": "Very recently; in the immediate past.",
  "given": "(ditransitive) To move, shift, provide something abstract or concrete to someone or something or somewhere.",
  "black": "The colour/color perceived in the absence of light, but also when no light is reflected, but rather absorbed.",
  "being": "A living creature.",
  "table": "Furniture with a top surface to accommodate a variety of uses.",
  "young": "People who are young; young people, collectively; youth.",
  "plate": "A slightly curved but almost flat dish from which food is served or eaten.",
  "laugh": "An expression of mirth particular to the human species; the sound heard in laughing; laughter.",
  "level": "A tool for finding whether a surface is level, or for creating a horizontal or vertical line of reference.",
  "point": "A discrete division of something.",
  "round": "So as to form a circle or trace a circular path, or approximation thereof.",
  "sugar": "Sucrose in the form of small crystals, obtained from sugar cane or sugar beet and used to sweeten food and drink.",
  "raise": "An increase in wages or salary; a rise (UK).",
  "piece": "A part of a larger whole, usually in such a form that it is able to be separated from other parts.",
  "grant": "The act of granting; a bestowing or conferring; concession; allowance; permission.",
  "music": "A series of sounds organized in time, employing melody, harmony, tempo etc. usually to convey a mood.",
  "sight": "(in the singular) The ability to see.",
  "those": "(demonstrative) The thing, person, idea, quality, event, action or time indicated or understood from context, especially if more remote geographically, temporally or mentally than one designated as \"this\", or if expressing distinction.",
  "model": "A person who serves as a subject for artwork or fashion, usually in the medium of photography but also for painting or drawing.",
  "climb": "An act of climbing.",
  "basic": "A necessary commodity, a staple requirement.",
  "count": "The act of counting or tallying a quantity.",
  "beach": "The shore of a body of water, especially when sandy or pebbly.",
  "three": "The digit/figure 3.",
  "peace": "A state of tranquility, quiet, and harmony; absence of violence. For instance, a state free from civil disturbance.",
  "visit": "A single act of visiting.",
  "layer": "A single thickness of some material covering a surface.",
  "photo": "A photograph.",
  "quick": "Raw or sensitive flesh, especially that underneath finger and toe nails.",
  "range": "A line or series of mountains, buildings, etc.",
  "waste": "Excess of material, useless by-products or damaged, unsaleable products; garbage; rubbish.",
  "motor": "A machine or device that converts other energy forms into mechanical energy, or imparts motion.",
  "cause": "(often with of, typically of adverse results) The source of, or reason for, an event or action; that which produces or effects a result.",
  "white": "The color/colour of snow or milk; the colour of light containing equal amounts of all visible wavelengths.",
  "super": "Of excellent quality, superfine.",
  "frank": "Free postage, a right exercised by governments (usually with definite article).",
  "drive": "Motivation to do or achieve something; ability coupled with ambition.",
  "drink": "To consume (a liquid) through the mouth.",
  "stock": "A store or supply.",
  "glass": "To apply fibreglass to.",
  "enjoy": "To receive pleasure or satisfaction from something",
  "power": "Ability to do or undergo something.",
  "cheap": "Trade; traffic; chaffer; chaffering.",
  "union": "The act of uniting or joining two or more things into one.",
  "tired": "To become sleepy or weary.",
  "pause": "A button whose functions are pausing and resuming something, such as a DVD player, a video game or a computer.",
  "cover": "A lid.",
  "split": "A crack or longitudinal fissure.",
  "ideal": "A perfect standard of beauty, intellect etc., or a standard of excellence to aim at.",
  "state": "A condition; a set of circumstances applying at any given time.",
  "clear": "Full extent; distance between extreme limits; especially; the distance between the nearest surfaces of two bodies, or the space between walls.",
  "throw": "To change place.",
  "major": "A military rank between captain and lieutenant colonel.",
  "board": "A relatively long, wide and thin piece of any material, usually wood or similar, often for use in construction or furniture-making.",
  "sweet": "The basic taste sensation induced by sugar.",
  "offer": "A proposal that has been made.",
  "knife": "A utensil or a tool designed for cutting, consisting of a flat piece of hard material, usually steel or other metal (the blade), usually sharpened on one edge, attached to a handle. The blade may be pointed for piercing.",
  "phase": "",
  "unity": "Oneness; the state or fact of being one undivided entity.",
  "prime": "The first hour of daylight; the first canonical hour.",
  "court": "An enclosed space; a courtyard; an uncovered area shut in by the walls of a building, or by different buildings; also, a space opening from a street and nearly surrounded by houses; a blind alley.",
  "place": "(physical) An area; somewhere within an area.",
  "catch": "The act of seizing or capturing.",
  "extra": "Something additional, such as an item above and beyond the ordinary school curriculum, or added to the usual charge on a bill.",
  "final": "A final examination; a test or examination given at the end of a term or class; the test that concludes a class.",
  "blank": "A small French coin, originally of silver, afterwards of copper, worth 5 deniers; also a silver coin of Henry V current in the parts of France then held by the English, worth about 8 pence .",
  "field": "A land area free of woodland, cities, and towns; open country.",
  "skill": "Capacity to do something well; technique, ability. Skills are usually acquired or learned, as opposed to abilities, which are often thought of as innate.",
  "party": "A person or group of people constituting a particular side in a contract or legal action.",
  "hotel": "A large town house or mansion; a grand private residence, especially in France.",
  "worth": "Value.",
  "flash": "A device that produces a short flash of light to help illuminate a scene, mostly for night-time or indoors photography.",
  "sheet": "A thin bed cloth used as a covering for a mattress or as a layer over the sleeper.",
  "speed": "The state of moving quickly or the capacity for rapid motion; rapidity.",
  "child": "A person who has not yet reached adulthood, whether natural (puberty), cultural (initiation), or legal (majority)",
  "sound": "Healthy.",
  "there": "That place.",
  "depth": "The vertical distance below a surface; the degree to which something is deep",
  "royal": "A royal person; a member of a royal family.",
  "chief": "A leader or head of a group of people, organisation, etc.",
  "pilot": "A person who steers a ship, a helmsman.",
  "floor": "The interior bottom or surface of a house or building; the supporting surface of a room.",
  "house": "A structure built or serving as an abode of human beings.",
  "print": "Books and other material created by printing presses, considered collectively or as a medium.",
  "touch": "",
  "mouse": "Any small rodent of the genus Mus.",
  "false": "One of two options on a true-or-false test.",
  "space": "(heading) Of time.",
  "stage": "A phase.",
  "other": "An other, another (person, etc), more often rendered as another.",
  "paint": "A substance that is applied as a liquid or paste, and dries into a solid coating that protects or adds color/colour to an object or surface to which it has been applied.",
  "since": "From a specified time in the past.",
  "doing": "(auxiliary) A syntactic marker.",
  "media": "The middle layer of the wall of a blood vessel or lymph vessel which is composed of connective and muscular tissue.",
  "money": "A legally or socially binding conceptual contract of entitlement to wealth, void of intrinsic value, payable for all debts and taxes, and regulated in supply.",
  "fixed": "To pierce; now generally replaced by transfix.",
  "strip": "A long, thin piece of land; any long, thin area.",
  "thing": "That which is considered to exist as a separate entity, object, quality or concept.",
  "alarm": "A summons to arms, as on the approach of an enemy.",
  "maker": "Someone who makes; a person or thing that makes or produces something.",
  "human": "A human being, whether man, woman or child.",
  "quiet": "The absence of sound; quietness.",
  "plant": "An organism that is not an animal, especially an organism capable of photosynthesis. Typically a small or herbaceous organism of this kind, rather than a tree.",
  "lucky": "(of people) Favoured by luck; fortunate; having good success or good fortune",
  "press": "A device used to apply pressure to an item.",
  "proud": "Feeling honoured (by something); feeling happy or satisfied about an event or fact; gratified.",
  "build": "The physique of a human body; constitution or structure of a human body.",
  "right": "Straight, not bent.",
  "where": "The place in which something happens.",
  "worry": "A strong feeling of anxiety.",
  "plain": "Flat, level.",
  "group": "A number of things or persons being in some relation to one another.",
  "drawn": "To move or develop something.",
  "usual": "The typical state of something, or something that is typical.",
  "pound": "A unit of mass equal to 16 avoirdupois ounces (= 453.592 37 g). Today this value is the most common meaning of \"pound\" as a unit of weight.",
  "whole": "Something complete, without any parts missing.",
  "early": "A shift (scheduled work period) that takes place early in the day.",
  "chair": "An item of furniture used to sit on or in, comprising a seat, legs, back, and sometimes arm rests, for use by one person. Compare stool, couch, sofa, settee, loveseat and bench.",
  "metal": "(heading) Chemical elements or alloys, and the mines where their ores come from.",
  "steel": "An artificial metal produced from iron, harder and more elastic than elemental iron; used figuratively as a symbol of hardness.",
  "happy": "A happy event, thing, person, etc.",
  "small": "Any part of something that is smaller or slimmer than the rest, now usually with anatomical reference to the back.",
  "found": "To encounter or discover by accident; to happen upon.",
  "fruit": "(often in the plural) In general, a product of plant growth useful to man or animals.",
  "total": "An amount obtained by the addition of smaller amounts.",
  "image": "An optical or other representation of a real object; a graphic; a picture.",
  "guide": "Someone who guides, especially someone hired to show people around a place or an institution and offer information and explanation.",
  "brave": "A Native American warrior.",
  "grass": "Any plant of the family Poaceae, characterized by leaves that arise from nodes in the stem and leaf bases that wrap around the stem, especially those grown as ground cover rather than for grain.",
  "green": "Having green as its color.",
  "solid": "A substance in the fundamental state of matter that retains its size and shape without need of a container (as opposed to a liquid or gas).",
  "boost": "A push from behind, as to one who is endeavoring to climb.",
  "weird": "Fate; destiny; luck.",
  "carry": "A manner of transporting or lifting something; the grip or position in which something is carried.",
  "cross": "A geometrical figure consisting of two straight lines or bars intersecting each other such that at least one of them is bisected by the other.",
  "heavy": "A villain or bad guy; the one responsible for evil or aggressive acts.",
  "later": "Near the end of a period of time.",
  "maybe": "Something that is possibly true.",
  "frame": "The structural elements of a building or other constructed object.",
  "check": "A situation in which the king is directly threatened by an opposing piece.",
  "arise": "To come up from a lower to a higher position.",
  "civic": "Of, relating to, or belonging to a city, a citizen, or citizenship; municipal or civil.",
  "baker": "A person who bakes and sells bread, cakes and similar items.",
  "bloom": "A blossom; the flower of a plant; an expanded bud.",
  "brain": "The control center of the central nervous system of an animal located in the skull which is responsible for perception, cognition, attention, memory, emotion, and action.",
  "bring": "(ditransitive) To transport toward somebody/somewhere.",
  "candy": "Edible, sweet-tasting confectionery containing sugar, or sometimes artificial sweeteners, and often flavored with fruit, chocolate, nuts, herbs and spices, or artificial flavors.",
  "chart": "A map.",
  "charm": "An object, act or words believed to have magic power (usually carries a positive connotation).",
  "chase": "The act of one who chases another; a pursuit.",
  "cheer": "A cheerful attitude; happiness; a good, happy, or positive mood.",
  "chest": "A box, now usually a large strong box with a secure convex lid.",
  "china": "The plant Smilax china, a liana of much of eastern Asia.",
  "civil": "Having to do with people and government office as opposed to the military or religion.",
  "claim": "A demand of ownership made for something.",
  "class": "A group, collection, category or set sharing characteristics or attributes.",
  "crane": "Any bird of the family Gruidae, large birds with long legs and a long neck which is extended during flight.",
  "crate": "A large open box or basket, used especially to transport fragile goods.",
  "crazy": "An insane or eccentric person; a crackpot.",
  "crime": "A specific act committed in violation of the law.",
  "crown": "A royal, imperial or princely headdress; a diadem.",
  "dairy": "(also dairy products or dairy produce) Products produced from milk.",
  "delay": "A period of time before an event occurs; the act of delaying; procrastination; lingering inactivity.",
  "demon": "An evil supernatural spirit.",
  "drama": "A composition, normally in prose, telling a story and intended to be represented by actors impersonating the characters and speaking the dialogue",
  "dream": "Imaginary events seen in the mind while sleeping.",
  "dress": "An item of clothing (usually worn by a woman or young girl) which both covers the upper part of the body and includes skirts below the waist.",
  "dwell": "A period of time in which a system or component remains in a given state.",
  "eager": "Sharp; sour; acid.",
  "eight": "The digit/figure 8.",
  "elite": "A special group or social class of people which have a superior intellectual, social or economic status as, the elite of society.",
  "entry": "The act of entering.",
  "error": "The state, quality, or condition of being wrong.",
  "favor": "A kind or helpful deed; an instance of voluntarily assisting (someone).",
  "fence": "A thin artificial barrier that separates two pieces of land or a house perimeter.",
  "ferry": "A ship used to transport people, smaller vehicles and goods from one port to another, usually on a regular schedule.",
  "fight": "To contend in physical conflict, either singly or in war, battle etc.",
  "fling": "An act of throwing, often violently.",
  "float": "A buoyant device used to support something in water or another liquid.",
  "future": "The time ahead; those moments yet to be experienced.",
  "gauge": "A measure; a standard of measure; an instrument to determine dimensions, distance, or capacity; a standard",
  "ghost": "The spirit; the soul of man.",
  "globe": "Any spherical (or nearly spherical) object.",
  "glory": "Great or overwhelming beauty or splendour.",
  "grace": "Charming, pleasing qualities.",
  "grade": "A rating.",
  "grand": "(plural \"grand\") A thousand of some unit of currency, such as dollars or pounds. (Compare G.)",
  "grasp": "(sometimes figurative) Grip.",
  "grave": "An excavation in the earth as a place of burial",
  "great": "A person of major significance, accomplishment or acclaim.",
  "greet": "To welcome in a friendly manner, either in person or through another means e.g. writing or over the phone/internet",
  "habit": "An action performed on a regular basis.",
  "handy": "Easy to use, useful.",
  "harsh": "To negatively criticize.",
  "honey": "A viscous, sweet fluid produced from plant nectar by bees. Often used to sweeten tea or to spread on baked goods.",
  "honor": "Recognition of importance or value; respect; veneration (of someone, usually for being morally upright or successful)",
  "imply": "(of a proposition) to have as a necessary consequence",
  "index": "An alphabetical listing of items and their location.",
  "inner": "An inner part.",
  "input": "The act or process of putting in; infusion.",
  "joint": "The point where two components of a structure join, but are still able to rotate.",
  "juice": "A liquid from a plant, especially fruit.",
  "jelly": "An explosive mixture of nitroglycerine and nitrate absorbed onto a base of wood pulp.",
  "labor": "Effort expended on a particular task; toil, work.",
  "laser": "A device that produces a monochromatic, coherent beam of light.",
  "leave": "To have a consequence or remnant.",
  "loyal": "Having or demonstrating undivided and constant support for someone or something.",
  "lumen": "In the International System of Units, the derived unit of luminous flux; the light that is emitted in a solid angle of one steradian from a source of one candela. Symbol: lm.",
  "meter": "(always meter) A device that measures things.",
  "merry": "Jolly and full of high spirits.",
  "might": "Power, strength, force or influence held by a person or group.",
  "minor": "A person who is below the age of majority, consent, criminal responsibility or other adult responsibilities and accountabilities."
}